src/Documents/Задание/Задание.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Задание</name>
  <comment>Аналог документа из ТШК 1С 7.7.</comment>
  <posting>Deny</posting>
  <attributes>
    <name>ВКоробах</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКоробках</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументНаПеремещение</name>
    <type>
      <types>DocumentRef.ВнПеремОтпуск</types>
    </type>
  </attributes>
  <attributes>
    <name>Зона</name>
    <type>
      <types>CatalogRef.АдресаТЛЦ</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусЗадания</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ЗаданияНаОтбор</name>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>7</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комплектовщик</name>
      <type>
        <types>CatalogRef.Комплектовщики</types>
      </type>
    </attributes>
    <attributes>
      <name>Модель</name>
      <type>
        <types>CatalogRef.Модели</types>
      </type>
    </attributes>
    <attributes>
      <name>Модификатор</name>
      <type>
        <types>CatalogRef.моделиКожтовар</types>
      </type>
    </attributes>
    <attributes>
      <name>Размер</name>
      <type>
        <types>CatalogRef.моделиРазмер</types>
      </type>
    </attributes>
    <attributes>
      <name>Уценка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цвет</name>
      <type>
        <types>CatalogRef.моделиЦвет</types>
      </type>
    </attributes>
    <attributes>
      <name>Ячейка</name>
      <type>
        <types>CatalogRef.АдресаТЛЦ</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Enums/ТипШтрихкода/ТипШтрихкода.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипШтрихкода</name>
  <enumValues>
    <name>DataMatrix</name>
    <comment>Двумерный штрихкод, содержит GTIN.</comment>
  </enumValues>
  <enumValues>
    <name>ТШК</name>
    <comment>Линейный штрихкод, представляет номер короба.</comment>
  </enumValues>
</mdclass:Enum>

src/Documents/Задание/Forms/ФормаВыполненияЗадания/Module.bsl
// @strict-types
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

    ФормаЗадание = Параметры.Задание;
    ФормаКомплектовщик = Параметры.Комплектовщик;

    ФормаСписокЗаданийНаОтбор.Параметры.УстановитьЗначениеПараметра("Задание", ФормаЗадание);
    ФормаСписокЗаданийНаОтбор.Параметры.УстановитьЗначениеПараметра("Комплектовщик", ФормаКомплектовщик);

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

#Если МобильныйКлиент Или МобильноеПриложениеКлиент Тогда

    // Отключение видимости шапки динамического списка, чтобы сэкономить место на экране 
    Элементы.СписокЗаданийНаОтбор.Шапка = Ложь;

#КонецЕсли

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОбработатьШтрихкодСФормы(Команда)

    ОбработатьШтрихкод(ФормаШтрихкод);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Функция возвращает ключ уникальности оповещений пользователя.
// 
// Возвращаемое значение:
//  Строка
&НаКлиенте
Функция КлючУникальностиОповещенийПользователя()

    Возврат ИмяФормы;

КонецФункции

// Процедура определяет тип штрихокда и выполняет
// его обработку в зависимости от типа.
// 
// Параметры:
//  Штрихкод - Строка
&НаКлиенте
Процедура ОбработатьШтрихкод(Штрихкод)

    Перем ОписаниеОбработкиШтрихкода; // См. КонтрольОтбора.НовоеОписаниеОбработкиШтрихкода

    // 1. Определение типа штрихкода
    Тип = ШтрихкодыКлиентСервер.ТипШтрихкода(Штрихкод);

    // 2.1. Остановить обработку, если не удалось определить тип штрихкода
    Если Тип = Неопределено Тогда

        ОповещенияПользователяКлиент.ПоказатьВажноеОповещениеОшибка("Неверный штрихкод",
                                                                    Штрихкод,
                                                                    КлючУникальностиОповещенийПользователя());
        Возврат;

    // 2.2. Обработка штрихкода короба
    ИначеЕсли Тип = ПредопределенноеЗначение("Перечисление.ТипШтрихкода.ТШК") Тогда

        ОповещенияПользователяКлиент.ПоказатьОповещение("Обработка ТШК",
                                                        Штрихкод,
                                                        КлючУникальностиОповещенийПользователя());

        ОписаниеОбработкиШтрихкода = ОбработатьШтрихкодКороба(Штрихкод);

    // 2.3. Обработка штрихкода россыпи
    ИначеЕсли Тип = ПредопределенноеЗначение("Перечисление.ТипШтрихкода.DataMatrix") Тогда

        ОповещенияПользователяКлиент.ПоказатьОповещение("Обработка КМ31",
                                                        Штрихкод,
                                                        КлючУникальностиОповещенийПользователя());

        ОписаниеОбработкиШтрихкода = ОбработатьШтрихкодРоссыпи(Штрихкод);

    КонецЕсли;

    
    // 3.1. Оповещение об успешной обработке
    Если ЭтоКодВозвратаУспех(ОписаниеОбработкиШтрихкода.КодВозврата) Тогда

        ЗаголовокОповещения = СтрШаблон("Задание на отбор %1 обработано",
                                        ОписаниеОбработкиШтрихкода.НомерЗаданияНаОтбор);
        ПояснениеОповещения = СтрШаблон("Количество %1 → %2",
                                        ОписаниеОбработкиШтрихкода.ПредыдущееКоличество,
                                        ОписаниеОбработкиШтрихкода.НовоеКоличество);

        ОповещенияПользователяКлиент.ПоказатьОповещение(ЗаголовокОповещения,
                                                        ПояснениеОповещения,
                                                        КлючУникальностиОповещенийПользователя());

    КонецЕсли;

КонецПроцедуры

// Процедура обрабатывает штрихкод короба.
// 
// Параметры:
//  Штрихкод - Строка
// 
// Возвращаемое значение:
//  См. КонтрольОтбора.НовоеОписаниеОбработкиШтрихкода
&НаСервере
Функция ОбработатьШтрихкодКороба(Знач Штрихкод)

    Возврат КонтрольОтбора.ОбработатьШтрихкодКороба(ФормаЗадание, ФормаКомплектовщик, Штрихкод);

КонецФункции

// Процедура обрабатывает штрихкод россыпи.
// 
// Параметры:
//  Штрихкод - Строка
// 
// Возвращаемое значение:
//  См. КонтрольОтбора.НовоеОписаниеОбработкиШтрихкода
&НаСервере
Функция ОбработатьШтрихкодРоссыпи(Знач Штрихкод)

    Возврат КонтрольОтбора.ОбработатьШтрихкодРоссыпи(ФормаЗадание, ФормаКомплектовщик, Штрихкод);

КонецФункции

#КонецОбласти
